/* 200 OK - : Запрос выполнен успешно. Сервер нашел и передал запрашиваемые данные. 
 Обычно возвращается при стандартном чтении страниц или отправке форм

201 Created: Запрос выполнен успешно, и на сервере создан новый ресурс. 
Часто используется в API после успешной регистрации пользователя или добавления нового товара

400 Bad Request: Некорректный запрос. 
Сервер не смог понять запрос из-за синтаксической ошибки, неверных данных или отсутствия обязательных параметров.

404 Not Found: Ресурс не найден. 
Сервер работает исправно, но запрашиваемый URL-адрес или документ на нем не существует.
The requested page could not be found but may be available again in the future

500 Internal Server Error: Внутренняя ошибка сервера. 
Запрос был составлен правильно, но на самом сервере произошел непредвиденный сбой 
(например, упала база данных или сломался код приложения) */
